#pragma once
#include <iostream>
#include <string>

#include "../Node/TreeNode.hpp"
#include "../e.Queue/e.Queue.hpp"

template <typename T>
class CBTree {
 private:
  TreeNode<T>* root_;

 public:
  // ============================================================================
  // КОНСТРУКТОР И ДЕСТРУКТОР
  // ============================================================================
  CBTree();   // Конструктор
  ~CBTree();  // Деструктор

  // ============================================================================
  // ЗАПРЕТ КОПИРОВАНИЯ И ПРИСВАИВАНИЯ
  // ============================================================================
  CBTree(const CBTree&) = delete;
  CBTree& operator=(const CBTree&) = delete;

  // ============================================================================
  // ЗАГРУЗКА ИЗ ФАЙЛА
  // ============================================================================
  void loadFromFile(const std::string& file);

  // ============================================================================
  // СОХРАНЕНИЕ В ФАЙЛ
  // ============================================================================
  void saveToFile(const std::string& file) const;

  void clear(TreeNode<T>*& node);

  // ============================================================================
  // F1 Добавление элемента
  // ============================================================================
  void insert(T value);
};

#include "f.CBTree.tpp"
#include "f.loadFromFile.tpp"
#include "f.saveToFile.tpp"
#include "f1.insert.tpp"
