#pragma once
#include <iostream>
#include <string>

#include "../Node/TreeNode.hpp"
#include "../e.Queue/e.Queue.hpp"

template <typename T>
class CBTree {
 private:
  TreeNode<T>* root_;

 public:
  // ============================================================================
  // КОНСТРУКТОР И ДЕСТРУКТОР
  // ============================================================================
  CBTree() : root_(nullptr) {}  // Конструктор
  ~CBTree() { clear(root_); };  // Деструктор

  // ============================================================================
  // ЗАПРЕТ КОПИРОВАНИЯ И ПРИСВАИВАНИЯ
  // ============================================================================
  CBTree(const CBTree&) = delete;
  CBTree& operator=(const CBTree&) = delete;

  void clear(TreeNode<T>*& node);

  // ============================================================================
  // F1 Добавление элемента
  // ============================================================================
  void insert(T value);

  // ============================================================================
  // F2 Поиск элемента
  // ============================================================================
  bool get_value(T value) const;
  void find_index(int index) const;
  bool find_value(TreeNode<T>* current, T value) const;

  // ============================================================================
  // F3 Проверка дерева на завершенность (Complete Binary Tree)
  // ============================================================================
  bool isCBT() const;

  // ============================================================================
  // F4 Вывод дерева
  // ============================================================================
  // Вывод дерева (вертикальный обход)
  void print_CBT(TreeNode<T>* current, int level) const;
  // Вывод в консоль (основная)
  void print() const;

  // ============================================================================
  // F5 ЗАГРУЗКА ИЗ ФАЙЛА
  // ============================================================================
  void loadFromFile(const std::string& file);

  // ============================================================================
  // F6 СОХРАНЕНИЕ В ФАЙЛ
  // ============================================================================
  void saveToFile(const std::string& file) const;
};

#include "f.clear.tpp"
#include "f1.insert.tpp"
#include "f2.findValue.tpp"
#include "f3.isCBT.tpp"
#include "f4.print.tpp"
#include "f5.loadFromFile.tpp"
#include "f6.saveToFile.tpp"
