#pragma once
#include <iostream>
#include <string>
#include <fstream>
#include <stdexcept>
#include "../Node/Node.hpp"

template <typename T>
class Queue {
 private:
  Node<T>* front_;
  Node<T>* end_;
  int size_;

 public:
  // ============================================================================
  // КОНСТРУКТОР И ДЕСТРУКТОР
  // ============================================================================
  Queue();   // Конструктор
  ~Queue();  // Деструктор

  // ============================================================================
  // ЗАПРЕТ КОПИРОВАНИЯ И ПРИСВАИВАНИЯ
  // ============================================================================
  Queue(const Queue&) = delete;
  Queue& operator=(const Queue&) = delete;

  // ============================================================================
  // E1 Добавление элемента: EPUSH value
  // ============================================================================
  void push(const T& value);

  // ============================================================================
  // E2 Удаление элемента: EPOP
  // ============================================================================
  void pop();

  // ============================================================================
  // E3 Печать очереди: PRINT
  // ============================================================================
  void print() const;

  // ============================================================================
  // СОХРАНЕНИЕ В ФАЙЛ
  // ============================================================================
  void saveToFile(const std::string& filename) const;

  // ============================================================================
  // ЗАГРУЗКА ИЗ ФАЙЛА
  // ============================================================================
  void loadFromFile(const std::string& filename);
};
#include "e.Queue.tpp"
#include "e1.push.tpp"
#include "e2.pop.tpp"
#include "e3.print.tpp"
#include "e.saveToFile.tpp"
#include "e.loadFromFile.tpp"