#pragma once
#include <fstream>
#include <iostream>
#include <stdexcept>
#include <string>

#include "../Node/Node.hpp"

template <typename T>
class Queue {
 private:
  Node<T>* front_;
  Node<T>* end_;
  int size_;

 public:
  // ============================================================================
  // КОНСТРУКТОР И ДЕСТРУКТОР
  // ============================================================================
  Queue() : front_(nullptr), end_(nullptr), size_(0) {}  // Конструктор
  ~Queue() {
    while (front_ != nullptr) {
      pop();
    }
  };  // Деструктор

  // ============================================================================
  // ЗАПРЕТ КОПИРОВАНИЯ И ПРИСВАИВАНИЯ
  // ============================================================================
  Queue(const Queue&) = delete;
  Queue& operator=(const Queue&) = delete;

  // ============================================================================
  // E1 Добавление элемента: EPUSH value
  // ============================================================================
  void push(const T& value);

  // ============================================================================
  // E2 Удаление элемента: EPOP
  // ============================================================================
  void pop();

  // ============================================================================
  // E3 Печать очереди: PRINT
  // ============================================================================
  void print() const;

  // ============================================================================
  // E4 СОХРАНЕНИЕ В ФАЙЛ
  // ============================================================================
  void saveToFile(const std::string& filename) const;

  // ============================================================================
  // E5 ЗАГРУЗКА ИЗ ФАЙЛА
  // ============================================================================
  void loadFromFile(const std::string& filename);

  // Вспомогательные методы для дерева
  // ============================================================================
  // Получение первого элемента без удаления
  // ============================================================================
  T front() {
    if (isEmpty()) {
      throw std::out_of_range("Queue is empty.");
    }
    return front_->data_;
  }

  // ============================================================================
  // ПРОВЕРКА НА ПУСТОТУ
  // ============================================================================
  bool isEmpty() const { return size_ == 0; }
};
#include "e1.push.tpp"
#include "e2.pop.tpp"
#include "e3.print.tpp"
#include "e4.loadFromFile.tpp"
#include "e5.saveToFile.tpp"