#pragma once
#include <fstream>
#include <iostream>
#include <stdexcept>
#include <string>

#include "../Node/Node.hpp"

template <typename T>
class Queue {
 private:
  Node<T>* front_;
  Node<T>* end_;
  int size_;

 public:
  // ============================================================================
  // КОНСТРУКТОР И ДЕСТРУКТОР
  // ============================================================================
  Queue();   // Конструктор
  ~Queue();  // Деструктор

  // ============================================================================
  // ЗАПРЕТ КОПИРОВАНИЯ И ПРИСВАИВАНИЯ
  // ============================================================================
  Queue(const Queue&) = delete;
  Queue& operator=(const Queue&) = delete;

  // ============================================================================
  // ГЕТТЕРЫ
  // ============================================================================
  int getSize() const { return size_; }
  Node<T>* getFront() const { return front_; }
  Node<T>* getEnd() const { return end_; }

  // ============================================================================
  // E1 Добавление элемента: EPUSH value
  // ============================================================================
  void push(const T& value);

  // ============================================================================
  // E2 Удаление элемента: EPOP
  // ============================================================================
  void pop();

  // ============================================================================
  // E3 Печать очереди: PRINT
  // ============================================================================
  void print() const;

  // ============================================================================
  // СОХРАНЕНИЕ В ФАЙЛ
  // ============================================================================
  void saveToFile(const std::string& filename) const;

  // ============================================================================
  // ЗАГРУЗКА ИЗ ФАЙЛА
  // ============================================================================
  void loadFromFile(const std::string& filename);

  // Вспомогательные методы для дерева
  // ============================================================================
  // Получение первого элемента без удаления
  // ============================================================================
  T front();

  // ============================================================================
  // ПРОВЕРКА НА ПУСТОТУ
  // ============================================================================
  bool isEmpty() const;
};
#include "e.Queue.tpp"
#include "e.front.tpp"
#include "e.isEmpty.tpp"
#include "e.loadFromFile.tpp"
#include "e.saveToFile.tpp"
#include "e1.push.tpp"
#include "e2.pop.tpp"
#include "e3.print.tpp"