#pragma once
#include <iostream>
#include <string>

#include "../Node/DoublyNode.hpp"  // Должен содержать struct DoublyNode

class DoublyLinkedList {
 private:
  DoublyNode* head_;
  DoublyNode* tail_;
  int size_;

 public:
  // ============================================================================
  // КОНСТРУКТОР
  // ============================================================================
  DoublyLinkedList();  // Конструктор

  // ============================================================================
  // ДЕСТРУКТОР
  // ============================================================================
  ~DoublyLinkedList();  // Деструктор

  // ============================================================================
  // Запрет копирования (так проще)
  // ============================================================================
  DoublyLinkedList(const DoublyLinkedList&) = delete;
  DoublyLinkedList& operator=(const DoublyLinkedList&) = delete;

  // ============================================================================
  // C1 Добавление элемента (в голову): BADDHEAD value
  // ============================================================================
  void addToHead(const std::string& value);

  // ============================================================================
  // C2 Добавление элемента (в хвост): BADDTAIL value
  // ============================================================================
  void addToTail(const std::string& value);

  // ============================================================================
  // C3 Удаление элемента (из головы): BDELHEAD
  // ============================================================================
  void removeFromHead();  // удаление головы

  // ============================================================================
  // C4 Удаление элемента (из хвоста): BDELTAIL
  // ============================================================================
  void removeFromTail();  // удаление хвоста

  // ============================================================================
  // СОХРАНЕНИЕ В ФАЙЛ
  // ============================================================================
  void saveToFile(const std::string& filename) const;

  // ============================================================================
  // ЗАГРУЗКА ИЗ ФАЙЛА
  // ============================================================================
  void loadFromFile(const std::string& filename);
};