#pragma once
#include <fstream>
#include <iostream>
#include <string>

#include "../Node/DoublyNode.hpp"  // Должен содержать struct DoublyNode

template <typename T>
class DoublyLinkedList {
 private:
  DoublyNode<T>* head_;
  DoublyNode<T>* tail_;
  int size_;

 public:
  // ============================================================================
  // КОНСТРУКТОР
  // ============================================================================
  DoublyLinkedList() : head_(nullptr), tail_(nullptr), size_(0){};

  // ============================================================================
  // ДЕСТРУКТОР
  // ============================================================================
  ~DoublyLinkedList() {
    while (head_ != nullptr) {
      removeFromHead();  // используем существующий метод
    }
  };

  // ============================================================================
  // Запрет копирования (так проще)
  // ============================================================================
  DoublyLinkedList(const DoublyLinkedList&) = delete;
  DoublyLinkedList& operator=(const DoublyLinkedList&) = delete;

  // ============================================================================
  // C1 Добавление элемента (в голову): BADDHEAD value
  // ============================================================================
  void addToHead(const T& value);

  // ============================================================================
  // C2 Добавление элемента (в хвост): BADDTAIL value
  // ============================================================================
  void addToTail(const T& value);

  // ============================================================================
  // C3 Удаление элемента (из головы): BDELHEAD
  // ============================================================================
  void removeFromHead();  // удаление головы

  // ============================================================================
  // C4 Удаление элемента (из хвоста): BDELTAIL
  // ============================================================================
  void removeFromTail();  // удаление хвоста

  // ============================================================================
  // C5 Вставка элемента перед указанным значением: BINSERTBEFORE targetValue
  // newValue
  // ============================================================================
  void insertBefore(const T& targetValue, const T& newValue);

  // ============================================================================
  // C6 Вставка элемента после указанного значения: BINSERTAFTER targetValue
  // newValue
  // ============================================================================
  void insertAfter(const T& targetValue, const T& newValue);

  // ============================================================================
  // C7 Удаление элемента перед указанным значением: BDELBEFORE targetValue
  // ============================================================================
  void removeBefore(const T& targetValue);

  // ============================================================================
  // C8 Удаление элемента после указанного значения: BDELAFTER targetValue
  // ============================================================================
  void removeAfter(const T& targetValue);

  // ============================================================================
  // C9 Поиск элемента по значению: BSEARCH value
  // ============================================================================
  DoublyNode<T>* searchByValue(const T& value) const;

  // ============================================================================
  // C10 Удаление элемента по значению: BREMOVE value
  // ============================================================================
  void removeByValue(const T& value);

  // ============================================================================
  // C11 Вывод списка: PRINT
  // ============================================================================
  void print() const;

  // ============================================================================
  // C12 Загрузка из файла
  // ============================================================================
  void loadFromFile(const std::string& filename);

  // ============================================================================
  // C13 Сохранение в файл
  // ============================================================================
  void saveToFile(const std::string& filename) const;
};

#include "c1.addToHead.tpp"
#include "c10.removeByValue.tpp"
#include "c11.print.tpp"
#include "c12.loadFromFile.tpp"
#include "c13.saveToFile.tpp"
#include "c2.addToTail.tpp"
#include "c3.removeFromHead.tpp"
#include "c4.removeFromTail.tpp"
#include "c5.insertBefore.tpp"
#include "c6.insertAfter.tpp"
#include "c7.removeBefore.tpp"
#include "c8.removeAfter.tpp"
#include "c9.searchByValue.tpp"
