#pragma once
#include <fstream>
#include <iostream>
#include <string>

#include "../Node/DoublyNode.hpp"  // Должен содержать struct DoublyNode

template <typename T>
class DoublyLinkedList {
 private:
  DoublyNode<T>* head_;
  DoublyNode<T>* tail_;
  int size_;

 public:
  // ============================================================================
  // КОНСТРУКТОР
  // ============================================================================
  DoublyLinkedList();  // Конструктор

  // ============================================================================
  // ДЕСТРУКТОР
  // ============================================================================
  ~DoublyLinkedList();  // Деструктор

  // ============================================================================
  // Запрет копирования (так проще)
  // ============================================================================
  DoublyLinkedList(const DoublyLinkedList&) = delete;
  DoublyLinkedList& operator=(const DoublyLinkedList&) = delete;

  // ============================================================================
  // СОХРАНЕНИЕ В ФАЙЛ
  // ============================================================================
  void saveToFile(const std::string& filename) const;

  // ============================================================================
  // ЗАГРУЗКА ИЗ ФАЙЛА
  // ============================================================================
  void loadFromFile(const std::string& filename);

  // ============================================================================
  // C1 Добавление элемента (в голову): BADDHEAD value
  // ============================================================================
  void addToHead(const T& value);

  // ============================================================================
  // C2 Добавление элемента (в хвост): BADDTAIL value
  // ============================================================================
  void addToTail(const T& value);

  // ============================================================================
  // C3 Удаление элемента (из головы): BDELHEAD
  // ============================================================================
  void removeFromHead();  // удаление головы

  // ============================================================================
  // C4 Удаление элемента (из хвоста): BDELTAIL
  // ============================================================================
  void removeFromTail();  // удаление хвоста

  // ============================================================================
  // C5 Вставка элемента перед указанным значением: BINSERTBEFORE targetValue newValue
  // ============================================================================
  void insertBefore(const T& targetValue, const T& newValue);

  // ============================================================================
  // C9 Поиск элемента по значению: BSEARCH value
  // ============================================================================
  DoublyNode<T>* searchByValue(const T& value) const;
};
#include "c.DoublyLinkedList.tpp"
#include "c.loadFromFile.tpp"
#include "c.saveToFile.tpp"
#include "c1.addToHead.tpp"
#include "c2.addToTail.tpp"
#include "c3.removeFromHead.tpp"
#include "c4.removeFromTail.tpp"
#include "c5.insertBefore.tpp"
#include "c9.searchByValue.tpp"
