#include "c.DoublyLinkedList.hpp"

// ============================================================================
// КОНСТРУКТОР
// ============================================================================
DoublyLinkedList::DoublyLinkedList()
    : head_(nullptr), tail_(nullptr), size_(0) {}

// ============================================================================
// ДЕСТРУКТОР
// ============================================================================
DoublyLinkedList::~DoublyLinkedList() {
  while (head_ != nullptr) {
    removeFromHead();  // используем существующий метод
  }
}