#pragma once
#include <iostream>
#include <string>
#include <fstream>

#include "../Node/Node.hpp"

template <typename T>
class SinglyLinkedList {
 private:
  Node<T>* head_;
  int size_;

 public:
  // ============================================================================
  // КОНСТРУКТОР
  // ============================================================================
  SinglyLinkedList();  // Конструктор

  // ============================================================================
  // ДЕСТРУКТОР
  // ============================================================================
  ~SinglyLinkedList();  // Деструктор

  // ============================================================================
  // Запрет копирования (так проще)
  // ============================================================================
  SinglyLinkedList(const SinglyLinkedList&) = delete;
  SinglyLinkedList& operator=(const SinglyLinkedList&) = delete;

  // ============================================================================
  // B1 Добавление элемента (в голову): BADDHEAD value
  // ============================================================================
  void addToHead(const T& value);

  // ============================================================================
  // B2 Добавление элемента (в хвост): BADDTAIL value
  // ============================================================================
  void addToTail(const T& value);

  // ============================================================================
  // B3 Удаление элемента (из головы): BDELHEAD
  // ============================================================================
  void removeFromHead();  // удаление головы

  // ============================================================================
  // B4 Удаление элемента (из хвоста): BDELTAIL
  // ============================================================================
  void removeFromTail();  // удаление хвоста

  // ============================================================================
  // СОХРАНЕНИЕ В ФАЙЛ
  // ============================================================================
  void saveToFile(const std::string& filename) const;

  // ============================================================================
  // ЗАГРУЗКА ИЗ ФАЙЛА
  // ============================================================================
  void loadFromFile(const std::string& filename);
};
#include "b.SinglyLinkedList.tpp"
#include "b1.addToHead.tpp"
#include "b2.addToTail.tpp"
#include "b3.removeFromHead.tpp"
#include "b4.removeFromTail.tpp"
#include "b.saveToFile.tpp"
#include "b.loadFromFile.tpp"