#pragma once
#include <iostream>
#include <string>

#include "../Node/Node.hpp"

class SinglyLinkedList {
 private:
  Node* head_;
  int size_;

 public:
  // ============================================================================
  // КОНСТРУКТОР
  // ============================================================================
  SinglyLinkedList();  // Конструктор

  // ============================================================================
  // ДЕСТРУКТОР
  // ============================================================================
  ~SinglyLinkedList();  // Деструктор

  // ============================================================================
  // Запрет копирования (так проще)
  // ============================================================================
  SinglyLinkedList(const SinglyLinkedList&) = delete;
  SinglyLinkedList& operator=(const SinglyLinkedList&) = delete;

  // ============================================================================
  // B1 Добавление элемента (в голову): BADDHEAD value
  // ============================================================================
  void addToHead(const std::string& value);

  // ============================================================================
  // B2 Добавление элемента (в хвост): BADDTAIL value
  // ============================================================================
  void addToTail(const std::string& value);

  // ============================================================================
  // B3 Удаление элемента (из головы): BDELHEAD
  // ============================================================================
  void removeFromHead();  // удаление головы

  // ============================================================================
  // B4 Удаление элемента (из хвоста): BDELTAIL
  // ============================================================================
  void removeFromTail();  // удаление хвоста

  // ============================================================================
  // СОХРАНЕНИЕ В ФАЙЛ
  // ============================================================================
  void saveToFile(const std::string& filename) const;

  // ============================================================================
  // ЗАГРУЗКА ИЗ ФАЙЛА
  // ============================================================================
  void loadFromFile(const std::string& filename);
};