#include "b.SinglyLinkedList.hpp"

// ============================================================================
// КОНСТРУКТОР
// ============================================================================
SinglyLinkedList::SinglyLinkedList() : head_(nullptr), size_(0) {}

// ============================================================================
// ДЕСТРУКТОР
// ============================================================================
SinglyLinkedList::~SinglyLinkedList() {
  while (head_ != nullptr) {
    removeFromHead();  // переиспользуем существующий метод
  }
}