#pragma once
#include <fstream>
#include <iostream>
#include <string>

#include "../Node/Node.hpp"

template <typename T>
class SinglyLinkedList {
 private:
  Node<T>* head_;
  int size_;

 public:
  // ============================================================================
  // КОНСТРУКТОР
  // ============================================================================
  SinglyLinkedList();  // Конструктор

  // ============================================================================
  // ДЕСТРУКТОР
  // ============================================================================
  ~SinglyLinkedList();  // Деструктор

  // ============================================================================
  // Запрет копирования (так проще)
  // ============================================================================
  SinglyLinkedList(const SinglyLinkedList&) = delete;
  SinglyLinkedList& operator=(const SinglyLinkedList&) = delete;

  // ============================================================================
  // СОХРАНЕНИЕ В ФАЙЛ
  // ============================================================================
  void saveToFile(const std::string& filename) const;

  // ============================================================================
  // ЗАГРУЗКА ИЗ ФАЙЛА
  // ============================================================================
  void loadFromFile(const std::string& filename);

  // ============================================================================
  // B1 Добавление элемента (в голову): BADDHEAD value
  // ============================================================================
  void addToHead(const T& value);

  // ============================================================================
  // B2 Добавление элемента (в хвост): BADDTAIL value
  // ============================================================================
  void addToTail(const T& value);

  // ============================================================================
  // B3 Удаление элемента (из головы): BDELHEAD
  // ============================================================================
  void removeFromHead();  // удаление головы

  // ============================================================================
  // B4 Удаление элемента (из хвоста): BDELTAIL
  // ============================================================================
  void removeFromTail();  // удаление хвоста

  // ============================================================================
  // B5 Вставка элемента перед указанным значением: BINSERTBEFORE targetValue
  // newValue
  // ============================================================================
  void insertBefore(const T& targetValue, const T& newValue);

  // ============================================================================
  // B6 Вставка элемента после указанного значения: BINSERTAFTER targetValue
  // newValue
  // ============================================================================
  void insertAfter(const T& targetValue, const T& newValue);

  // ============================================================================
  // B7 Удаление элемента перед указанным значением: BDELBEFORE targetValue
  // ============================================================================
  void removeBefore(const T& targetValue);

  // ============================================================================
  // B8 Удаление элемента после указанного значения: BDELAFTER targetValue
  // ============================================================================
  void removeAfter(const T& targetValue);
};
#include "b.SinglyLinkedList.tpp"
#include "b.loadFromFile.tpp"
#include "b.saveToFile.tpp"
#include "b1.addToHead.tpp"
#include "b2.addToTail.tpp"
#include "b3.removeFromHead.tpp"
#include "b4.removeFromTail.tpp"
#include "b5.insertBefore.tpp"
#include "b6.insertAfter.tpp"
#include "b7.removeBefore.tpp"
#include "b8.removeAfter.tpp"