#pragma once
#include <fstream>
#include <iostream>
#include <string>

#include "../Node/Node.hpp"

template <typename T>
class SinglyLinkedList {
 private:
  Node<T>* head_;
  int size_;

 public:
  // ============================================================================
  // КОНСТРУКТОР
  // ============================================================================
  SinglyLinkedList() : head_(nullptr), size_(0) {}

  // ============================================================================
  // ДЕСТРУКТОР
  // ============================================================================
  ~SinglyLinkedList() {
    while (head_ != nullptr) {
      removeFromHead();  // используем существующий метод
    }
  };  // Деструктор

  // ============================================================================
  // Запрет копирования (так проще)
  // ============================================================================
  SinglyLinkedList(const SinglyLinkedList&) = delete;
  SinglyLinkedList& operator=(const SinglyLinkedList&) = delete;

  // ============================================================================
  // B1 Добавление элемента (в голову): BADDHEAD value
  // ============================================================================
  void addToHead(const T& value);

  // ============================================================================
  // B2 Добавление элемента (в хвост): BADDTAIL value
  // ============================================================================
  void addToTail(const T& value);

  // ============================================================================
  // B3 Удаление элемента (из головы): BDELHEAD
  // ============================================================================
  void removeFromHead();  // удаление головы

  // ============================================================================
  // B4 Удаление элемента (из хвоста): BDELTAIL
  // ============================================================================
  void removeFromTail();  // удаление хвоста

  // ============================================================================
  // B5 Вставка элемента перед указанным значением: BINSERTBEFORE targetValue
  // newValue
  // ============================================================================
  void insertBefore(const T& targetValue, const T& newValue);

  // ============================================================================
  // B6 Вставка элемента после указанного значения: BINSERTAFTER targetValue
  // newValue
  // ============================================================================
  void insertAfter(const T& targetValue, const T& newValue);

  // ============================================================================
  // B7 Удаление элемента перед указанным значением: BDELBEFORE targetValue
  // ============================================================================
  void removeBefore(const T& targetValue);

  // ============================================================================
  // B8 Удаление элемента после указанного значения: BDELAFTER targetValue
  // ============================================================================
  void removeAfter(const T& targetValue);

  // ============================================================================
  // B9 Поиск элемента по значению: BSEARCH value
  // ============================================================================
  Node<T>* searchByValue(const T& value) const;

  // ============================================================================
  // B10 Удаление элемента по значению: BREMOVE value
  // ============================================================================
  void removeByValue(const T& value);

  // ============================================================================
  // B11 Вывод списка: PRINT
  // ============================================================================
  void print() const;

  // ============================================================================
  // B12 ЗАГРУЗКА ИЗ ФАЙЛА
  // ============================================================================
  void loadFromFile(const std::string& filename);

  // ============================================================================
  // B13 СОХРАНЕНИЕ В ФАЙЛ
  // ============================================================================
  void saveToFile(const std::string& filename) const;
};
#include "b1.addToHead.tpp"
#include "b10.removeByValue.tpp"
#include "b11.print.tpp"
#include "b12.loadFromFile.tpp"
#include "b13.saveToFile.tpp"
#include "b2.addToTail.tpp"
#include "b3.removeFromHead.tpp"
#include "b4.removeFromTail.tpp"
#include "b5.insertBefore.tpp"
#include "b6.insertAfter.tpp"
#include "b7.removeBefore.tpp"
#include "b8.removeAfter.tpp"
#include "b9.searchByValue.tpp"
