#pragma once
#include <iostream>
#include <string>

class Array {
 private:
  int maxCapacity_;    // Максимальная вместимость массива
  int size_;           // Текущий размер массива (количество элементов)
  std::string *data_;  // Указатель на динамический массив строк
 public:
  // ============================================================================
  // КОНСТРУКТОР
  // ============================================================================
  explicit Array(int max);  // Создает массив на max элементов
  // explicit защищает от неожиданных неявных преобразований

  // ============================================================================
  // ДЕСТРУКТОР
  // ============================================================================
  ~Array();  // Освобождает память

  // ============================================================================
  // A1 Добавление элемента(в конец массива): AADD value
  // ============================================================================
  void addToTheEnd(const std::string &value);

  void saveToFile(const std::string &filename) const;
  void loadFromFile(const std::string &filename);
};
