#pragma once
#include <fstream>
#include <iostream>
#include <stdexcept>
#include <string>

template <typename T>
class Array {
 private:
  int maxCapacity_;  // Максимальная вместимость массива
  int size_;  // Текущий размер массива (количество элементов)
  T *data_;  // Указатель на динамический массив строк

  void resize(int new_capacity);

 public:
  // ============================================================================
  // КОНСТРУКТОР
  // ============================================================================
  explicit Array(int max);  // Создает массив на max элементов
  // explicit защищает от неожиданных неявных преобразований

  // ============================================================================
  // ДЕСТРУКТОР
  // ============================================================================
  ~Array();  // Освобождает память

  // ============================================================================
  // ГЕТТЕРЫ
  // ============================================================================
  int getSize() const { return size_; }
  int getMaxCapacity() const { return maxCapacity_; }

  // ============================================================================
  // A1 Добавление элемента(в конец массива): AADD value
  // ============================================================================
  void addToTheEnd(const T &value);

  // ============================================================================
  // A2 Добавление элемента(по индексу): AINSERT index value
  // ============================================================================
  void addToTheIndex(int index, const T &value);

  // ============================================================================
  // A3 Получение элемента(по индексу): AGET index
  // ============================================================================
  T get(int index) const;

  // ============================================================================
  // A4 Удаление элемента(по индексу): ADEL index
  // ============================================================================
  void removeByIndex(int index);

  // ============================================================================
  // A5 Замена элемента(по индексу): ASET index value
  // ============================================================================
  void replaceByIndex(int index, const T &value);

  // ============================================================================
  // A6 Получение длины массива: ALENGTH
  // ============================================================================
  int length() const;

  // ============================================================================
  // A7 Печать массива: APRINT
  // ============================================================================
  void print() const;

  void saveToFile(const std::string &filename) const;
  void loadFromFile(const std::string &filename);
};
#include "a.Array.tpp"
#include "a.loadFromFile.tpp"
#include "a.saveToFile.tpp"
#include "a1.addToTheEnd.tpp"
#include "a2.addToTheIndex.tpp"
#include "a3.get.tpp"
#include "a4.removeByIndex.tpp"
#include "a5.replaceByIndex.tpp"
#include "a6.length.tpp"
#include "a7.print.tpp"
