#pragma once
#include <fstream>
#include <iostream>
#include <stdexcept>
#include <string>

#include "../Node/Node.hpp"

template <typename T>
class Stack {
 private:
  Node<T>* top_;
  int size_;

 public:
  // ============================================================================
  // КОНСТРУКТОР
  // ============================================================================
  Stack() : top_(nullptr), size_(0) {}
  // ============================================================================
  // ДЕСТРУКТОР
  // ============================================================================
  ~Stack() { clear(); };

  void clear() {
    while (top_ != nullptr) {
      pop();
    }
  }

  // ============================================================================
  // ЗАПРЕТ КОПИРОВАНИЯ И ПРИСВАИВАНИЯ
  // ============================================================================
  Stack(const Stack&) = delete;
  Stack& operator=(const Stack&) = delete;

  // ============================================================================
  // D1 Добавление элемента: DPUSH value
  // ============================================================================
  void push(const T& value);

  // ============================================================================
  // D2 Удаление элемента: DPOP
  // ============================================================================
  void pop();

  // ============================================================================
  // D3 Печать стека: PRINT
  // ============================================================================
  void print() const;

  // ============================================================================
  // D4 ЗАГРУЗКА ИЗ ФАЙЛА
  // ============================================================================
  void loadFromFile(const std::string& filename);

  // ============================================================================
  // D5 СОХРАНЕНИЕ В ФАЙЛ
  // ============================================================================
  void saveToFile(const std::string& filename) const;

  // ============================================================================
  // D6 ЗАГРУЗКА ИЗ БИНАРНОГО ФАЙЛА
  // ============================================================================
  void loadFromBinaryFile(const std::string& filename);

  // ============================================================================
  // D7 СОХРАНЕНИЕ В БИНАРНЫЙ ФАЙЛ
  // ============================================================================
  void saveToBinaryFile(const std::string& filename) const;
};

#include "d1.push.tpp"
#include "d2.pop.tpp"
#include "d3.print.tpp"
#include "d4.loadFromFile.tpp"
#include "d5.saveToFile.tpp"
#include "d6.loadFromBinaryFile.tpp"
#include "d7.saveToBinaryFile.tpp"